of-6/OpenFOAM-6-master/tutorials/DNS/dnsFoam/boxTurb16/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

runApplication blockMesh
runApplication boxTurb
runApplication $application
runApplication -s enstrophy  postProcess -func enstrophy

#------------------------------------------------------------------------------
